//*****************************************************************************
//	
//		テクスチャー
//													Author : Yusuke Seki
//*****************************************************************************
#include "texture.h"
#include "renderer.h"
#include "TextureManager.h"


//-----------------------------------------------------------------------------
// コンストラクタ
//-----------------------------------------------------------------------------
Texture::Texture(const char* texPass) : TextureManager()
{
	m_pTexture = nullptr;
	LoadTexture(texPass);
}


//-----------------------------------------------------------------------------
// デストラクタ
//-----------------------------------------------------------------------------
Texture::~Texture()
{
	UnLoad();
}


//-----------------------------------------------------------------------------
// 生成
//-----------------------------------------------------------------------------
Texture* Texture::Create(const char* texPass)
{
	Texture* pTexture = new Texture(texPass);

	return pTexture;
}


//-----------------------------------------------------------------------------
// 解放
//-----------------------------------------------------------------------------
void Texture::Release()
{
	UnLoad();

	delete this;
}


//-----------------------------------------------------------------------------
// 読み込み
//-----------------------------------------------------------------------------
void Texture::LoadTexture(const char* texPass)
{
	if (texPass == nullptr) return;

	UnLoad();

	if (FAILED(D3DXCreateTextureFromFile(Renderer::GetDevice(), texPass, &m_pTexture))) {
		_MSGERROR("Cannot Load Texture!!\n"
				  "Please Check Texture Pass!!", texPass);
	}
}


//-----------------------------------------------------------------------------
// 破棄
//-----------------------------------------------------------------------------
void Texture::UnLoad()
{
	// テクスチャの破棄
	if (m_pTexture != nullptr) {
		m_pTexture->Release();
		m_pTexture = nullptr;
	}
}


